from odoo import _
PAYMENT_CHANNEL_USE_TYPE = [('1', '放款/退款'), ('2', '还款')]

CHANNEL_FEE_MODE = [('1', '默认模式'), ('2', '阶梯收费')]

FLOW_TYPE = [('1', "出账"), ('2', "入账")]

TRADE_TYPE = [
    ('1', '放款金额'),
    ('2', '放款扣服务费'),
    ('3', '放款手续费'),
    ('4', '放款税收'),
    ('5', '线下退回'),
    ('6', '退回手续费'),
    ('7', '还款本金'),
    ('8', '还款罚息'),
    ('9', '还款滞纳金'),
    ('10', '还款手续费'),
    ('11', '还款税收'),
    ('12', '平台额外收益'),
    ('13', '取消还款'),
    ('14', '退款金额'),
    ('15', '退款手续费'),
    ('16', '退款税收'),
    ('17', '展期费'),
    ('18', '平台额外收益'),
    ('19', '展期手续费'),
    ('20', '展期税收'),
    ('21', '减免金额'),
    ('22', '减免金额退回'),
    ('23', '还款平账'),
    ('24', '展期平账')
]

ORDER_TYPE = [('1', '首贷'), ('2', '复贷')]

PAY_TYPE = [('1', '正常放款'), ('2', '展期放款')]

PAY_STATUS = [
    ('0', '未放款'),
    ('1', '待放款'),
    ('2', '放款中'),
    ('3', '放款成功'),
    ('4', '放款失败'),
    ('5', '放款拒绝')
]

MODIFY_ACCOUNT_STATUS = [
    ('0', '未触发'),
    ('1', '修改中'),
    ('2', '修改成功'),
    ('3', '修改失败')
]

FINANCIAL_STATUS = [
    ('1', '待审核'),
    ('2', '通过'), 
    ('3', '拒绝')
]

REPAY_STATUS = [
    ('0', '未触发'),
    ('1', '待还款'),
    ('2', '还款成功')
]

REPAY_ORDER_TYPE = [
    ('1', '正常还款'),
    ('2', '展期还款')
]

REPAY_RECORD_TYPE = [
    ('1', '正常收款'),
    ('2', '展期收款')
]

EXTENSION_STATUS = [
    ('1', _('Pending Payment')),
    ('2', _('Pay Success')),
    ('3', _('Pay Failed')),
    ('4', _('Partial Payment')),
    ('5', _('Repayment Completed')),
    ('6', _('Expired'))
]

ADDITION_TYPE = [
    ('1', _('Repayment Reorder')),
    ('2', _('Extension Application Form'))
]

ADDITION_STATUS = [
    ('1', '待处理'),
    ('2', '处理中'),
    ('3', '已到账'),
    ('4', '已关闭')
]

DERATE_TYPE = [
    ('1', '有效期减免'),
    ('2', '永久性减免')
]

DERATE_APPROVAL_STATUS = [
    ('0', '未触发'),
    ('1', '待审核'),
    ('2', '通过'),
    ('3', '拒绝')
]

SETTLE_TYPE = [
    ('1', '平账'),
    ('2', '抹罚息')
]

REFUND_TYPE = [
    ('1', '正常退款'),
    ('2', '手动退款')
]

REFUND_STATUS = [
    ('0', '未触发'), 
    ('1', '待退款'), 
    ('2', '退款中'), 
    ('3', '退款成功'),
    ('4', '退款失败'),
    ('5', '退款拒绝')
]

