

ORDER_TYPE = [('1', '首贷'), ('2', '复贷')]


ORDER_STATUS = [
    ('0', '未处理'),
    ('1', '信审中'), 
    ('2', '信审拒绝'), 
    ('3', '待放款'), 
    ('4', '财务拒绝'),
    ('5', '放款中'),
    ('6', '放款失败'),
    ('7', '待还款'),
    ('8', '还款成功'),
]

AUDIT_ASSIGN_STATUS = [
    ('0', '无'),
    ('1', '待分配'),
    ('2', '已分配')
]

AUDIT_STATUS = [
    ('0', '无'),
    ('1', '待审核'),
    ('2', '通过'),
    ('3', '拒绝')
]

AUDIT_REASON = [
    ('1', '无异常通过'), 
    ('2', '申请人核身失败'), 
    ('3', '联系人号码无效'),
    ('4', '申请人信息无法核实'),
    ('5', '无法联络申请人'),
    ('99', '其他')
]






